procedure meraminn;
label 10,99;
var
     xa,ya,xb,yb,x,y,x1,y1,x2,y2,x3,y3,x4,y4,x5,y5,x6,y6,x7,y7,x8,y8,x9,y9,x10,y10,x11,y11,x12,y12:real;
  

H2,h:handle;

     F,s:real;


begin
        getpt(x,y);
h:=actlayer;
s:=getlscale(h);
F:=2*S;



     textsize(10);
dselectall;



Message('水平寸法を取りたい左側をｸﾘｯｸしてください｡ 終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
          getpt(x,y);
              x1:=x;
              y1:=y;

Message('水平寸法を取りたい右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x2:=x;
              y2:=y;
    if (x1=x2) and (y1=y2) then goto 99;
 Message('引出し線の始点をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              xa:=x;
              ya:=y;
    if (x2=xa) and (y2=ya) then goto 99;     
Message('寸法値のおく位置をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              xb:=x;
              yb:=y;
 if (xb=xa) and (yb=ya) then goto 99;  


{起動最初の寸法値のずれのエラーを直す}
  lineardim(x1,ya-F,x2,ya-F,(yb-ya+F),0,769,259,1);  
H2:=LNEWOBJ;
DELOBJECT(H2);



if yb>ya then
begin


pensize(8);
     lineardim(x1,ya-F,x2,ya-F,(yb-ya+F),0,769,259,1);  



{2--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x3:=x;
              y3:=y;
    if (x2=x3) and (y2=y3) then goto 99;
 lineardim(x2,ya-F,x3,ya-F,(yb-ya+F),0,769,259,1);  


{3--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x4:=x;
              y4:=y;
    if (x3=x4) and (y3=y4) then goto 99;
 lineardim(x3,ya-F,x4,ya-F,(yb-ya+F),0,769,259,1);  


{4--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x5:=x;
              y5:=y;
    if (x4=x5) and (y4=y5) then goto 99;
 lineardim(x4,ya-F,x5,ya-F,(yb-ya+F),0,769,259,1);  

{5--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x6:=x;
              y6:=y;
    if (x5=x6) and (y5=y6) then goto 99;
 lineardim(x5,ya-F,x6,ya-F,(yb-ya+F),0,769,259,1);  

{6--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x7:=x;
              y7:=y;
    if (x6=x7) and (y6=y7) then goto 99;
 lineardim(x6,ya-F,x7,ya-F,(yb-ya+F),0,769,259,1);  

{7--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x8:=x;
              y8:=y;
    if (x7=x8) and (y7=y8) then goto 99;
 lineardim(x7,ya-F,x8,ya-F,(yb-ya+F),0,769,259,1);  


{8--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x9:=x;
              y9:=y;
    if (x8=x9) and (y8=y9) then goto 99;
 lineardim(x8,ya-F,x9,ya-F,(yb-ya+F),0,769,259,1);  


{9--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x10:=x;
              y10:=y;
    if (x9=x10) and (y9=y10) then goto 99;
 lineardim(x9,ya-F,x10,ya-F,(yb-ya+F),0,769,259,1);  

{10--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x11:=x;
              y11:=y;
    if (x10=x11) and (y10=y11) then goto 99;
 lineardim(x10,ya-F,x11,ya-F,(yb-ya+F),0,769,259,1);  

end
else
begin
pensize(8);
     lineardim(x1,ya+F,x2,ya+F,(yb-ya-F),0,769,259,1);  


{2--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x3:=x;
              y3:=y;
    if (x2=x3) and (y2=y3) then goto 99;
 lineardim(x2,ya+F,x3,ya+F,(yb-ya-F),0,769,259,1);  


{3--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x4:=x;
              y4:=y;
    if (x3=x4) and (y3=y4) then goto 99;
 lineardim(x3,ya+F,x4,ya+F,(yb-ya-F),0,769,259,1);  


{4--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x5:=x;
              y5:=y;
    if (x4=x5) and (y4=y5) then goto 99;
 lineardim(x4,ya+F,x5,ya+F,(yb-ya-F),0,769,259,1);  

{5--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x6:=x;
              y6:=y;
    if (x5=x6) and (y5=y6) then goto 99;
 lineardim(x5,ya+F,x6,ya+F,(yb-ya-F),0,769,259,1);  

{6--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x7:=x;
              y7:=y;
    if (x6=x7) and (y6=y7) then goto 99;
 lineardim(x6,ya+F,x7,ya+F,(yb-ya-F),0,769,259,1);  


{7--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x8:=x;
              y8:=y;
    if (x7=x8) and (y7=y8) then goto 99;
 lineardim(x7,ya+F,x8,ya+F,(yb-ya-F),0,769,259,1);  

{8--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x9:=x;
              y9:=y;
    if (x8=x9) and (y8=y9) then goto 99;
 lineardim(x8,ya+F,x9,ya+F,(yb-ya-F),0,769,259,1);  


{9--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x10:=x;
              y10:=y;
    if (x9=x10) and (y9=y10) then goto 99;
 lineardim(x9,ya+F,x10,ya+F,(yb-ya-F),0,769,259,1);  

{10--------------------------------------------------------------------}
Message('水平寸法を取りたい次の右側をｸﾘｯｸしてください｡終了はﾀﾞﾌﾞﾙｸﾘｯｸです');
        getpt(x,y);
              x11:=x;
              y11:=y;
    if (x10=x11) and (y10=y11) then goto 99;
 lineardim(x10,ya+F,x11,ya+F,(yb-ya-F),0,769,259,1);  


end;

ClrMessage;
redrawall;



99:ClrMessage;
settool(-128);
end;
run(meraminn);